import List from '@/components/TextComponents/List'
import Paragraph from '@/components/TextComponents/Paragraph'
import Subtitle from '@/components/TextComponents/SubTitle'
import Link from 'next/link'

const ExchangePage = () => {
	return (
		<>
			<Subtitle title='Повернення' />
			<Paragraph text='Який товар можна повернути' />
			<Paragraph text='Товар належної якості, придбаний на Lama store, можна повернути протягом 30-ти календарних днів з дати його отримання.' />
			<Paragraph text='Поверненню підлягає тільки новий товар, який не має слідів використання і не був в експлуатації, за умови:' />
			<List
				list={
					<>
						<li>збереження його товарного вигляду і споживчих властивостей;</li>
						<li>відсутність слідів використання і забруднень;</li>
						<li>збереження пломб, ярликів, бірок, захисних плівок;</li>
						<li>збереження заводського маркування;</li>
						<li>
							цілісності, неушкодженості, збереження всіх частин індивідуальної
							(заводської) упаковки.
						</li>
					</>
				}
			/>
			<Paragraph text='Не підлягає поверненню якісний товар наступних категорій*:' />
			<List
				list={
					<>
						<li>
							товари для немовлят (зокрема, пелюшки, соски, пляшечки для
							годування тощо);
						</li>
						<li>
							білизна натільна (зокрема, спідня білизна, боді, корсети, купальні
							костюми та купальний одяг, нічні сорочки, піжами, халати, домашні
							костюми);
						</li>
						<li>панчішно-шкарпеткові вироби;</li>
						<li>рукавички, рукавиці, та комплекти, що їх включають;</li>
						<li>
							ювелірні вироби з дорогоцінних металів, дорогоцінного каміння,
							дорогоцінного каміння органогенного утворення та напів
							дорогоцінного каміння;
						</li>
						<li>
							а також інші товари, включені Кабінетом Міністрів України до
							переліку товарів що не підлягають поверненню / обміну.
						</li>
					</>
				}
			/>
			<Paragraph text='* товар цієї категорії можна повернути виключно у разі виявлення виробничого браку.' />
			<Paragraph text='Товар неналежної якості, придбаний на Lama store, можна повернути протягом його гарантійного строку, якщо недоліки товару виникли з вини виробника або продавця товару.' />
			<Subtitle title='Способи повернення товару' />
			<Paragraph text='Ви можете повернути товар службами доставки Укрпошта, Нова Пошта (доставку оплачує відправник згідно з тарифами обраної ним служби доставки та обраного способу відправки)' />
			<Paragraph
				text={
					<>
						<span>Зверніть увагу!</span> Оформлюючи посилку з поверненням,
						обов’язково вказуйте її оціночну вартість в розмірі, що дорівнює
						сумі вартості всіх товарів, що повертаються, зазначеної в товарному
						чеку. У разі втрати або пошкодження посилки відшкодування вартості
						товару буде виплачене в межах суми вказаної вами оголошеної
						вартості.
					</>
				}
			/>
			<Paragraph
				text={
					<>
						<span>Важливо!</span> Якщо ви відправите посилку з поверненням
						товару на умовах оплати одержувачем ("накладений платіж" тощо),
						продавець не зможе її отримати, і товар повернеться вам, а кошти за
						товар не повернуться.
					</>
				}
			/>
			<Paragraph text='Адреса для відправки товару:' />
			<List
				list={
					<>
						<li>
							відправка через Укрпошту: 31564, м. Київ, вул. Димитрівська 112/2,
							телефон отримувача - +380 67 111-11-00;
						</li>
						<li>
							відправка через відділення або кур'єром Нова пошти: 31564, м.
							Київ, вул. Димитрівська 112/2, телефон отримувача - +380 67
							111-11-00
						</li>
					</>
				}
			/>
			<Paragraph
				text={
					<>
						<span>Зверніть увагу!</span> Якщо доставка товару з оплатою після
						отримання, ви також сплачуєте комісію за переказ коштів згідно
						тарифів, що діють у відповідній службі доставки для замовлень Lama
						store:
					</>
				}
			/>
			<List
				list={
					<>
						<li>Укрпошта - 10 грн + 2% від суми переказу;</li>
						<li>Нова Пошта - 20 грн. + 2% від суми переказу.</li>
					</>
				}
			/>
			<Paragraph text='Комісію за переказ коштів утримує фінансова компанія, що забезпечує грошові перекази у відповідній службі доставки. Lama store не отримує і не повертає комісію за переказ коштів.' />
			<Subtitle title='Повернення коштів за товар' />
			<Paragraph text='Кошти за повернутий товар повертаються автоматично на банківську карту, з якої цей товар було оплачено.' />
			<Paragraph text='Кошти за товар, оплачений готівкою, повертаються автоматично на банківську карту, зазначену у вашому Профілі як основна.' />
			<Paragraph
				text={
					<>
						<span>Важливо!</span> Кошти повертаються після отримання товару
						продавцем, перевірки та підтвердження підстав для повернення товару.
					</>
				}
			/>
			<Paragraph text='Не рекомендується використовувати для повернення коштів банківську карту, відкриту для заробітної плати, пенсій, стипендій, соціальних виплат, якщо товар був оплачений з іншої карти. Продавець та Адміністратор не несуть відповідальності за затримку надходження коштів, зняття комісії чи інші наслідки обробки банком платежу на таку карту.' />
			<Subtitle title='Термін виплати коштів за повернутий товар' />
			<Paragraph text='Кошти повертаються протягом 1-3 днів з моменту отримання товару продавцем.' />
			<Paragraph text='Строк повернення коштів продовжується на час врегулювання наступних питань:' />
			<List
				list={
					<>
						<li>
							якщо, повертаючи товар, ви не додали до нього всі комплектуючі або
							супровідні документи;
						</li>
						<li>
							якщо вказані вами підстави повернення товару потребують
							підтвердження (зокрема, наявність або причина недоліків товару,
							перевірка причин їх виникнення, віднесення товару до переліку тих,
							що не підлягають поверненню);
						</li>
						<li>якщо товар було втрачено/пошкоджено службою доставки;</li>
						<li>
							якщо вами не додано в Профіль банківську карту для зарахування
							повернення;
						</li>
					</>
				}
			/>
			<Paragraph text='При поверненні товару, який був оплачений за допомогою сервісів «Оплата частинами» від ПриватБанку чи «Покупка частинами» від monobank, повернення коштів відбувається на карту відповідного банку з урахуванням умов відповідного кредитного договору.' />
			<Subtitle title='Обмін' />
			<Paragraph text='Споживач має право повернути або обміняти придбаний товар, якщо він не задовольнив його за формою, габаритами, фасоном, кольором, розміром або з інших причин не може бути ним використаний за призначенням.' />
			<Paragraph text='Слід мати на увазі, що повернути або обміняти товар можна, якщо він не використовувався і якщо збережено його товарний вигляд, споживчі властивості, пломби, ярлики, а також розрахунковий документ, виданий споживачеві разом з проданим товаром.' />
			<Paragraph
				text={
					<>
						Для обміну товару{' '}
						<Link rel='prefetch' href='/contacts'>
							зв’яжіться з нами
						</Link>{' '}
						і ми оберемо підходящий для вас варіант обміну.
					</>
				}
			/>
		</>
	)
}

export default ExchangePage
