// import Meta from '@/components/Meta'
import List from '@/components/TextComponents/List'
import Paragraph from '@/components/TextComponents/Paragraph'
import Subtitle from '@/components/TextComponents/SubTitle'
import Link from 'next/link'

const DeliveryPage = () => {
	return (
		<>
			{/* <Meta title='s' description='sf' /> */}
			<Subtitle title='Доставка' />
			<Paragraph text='При оформленні замовлення будуть доступні служби доставки, які можуть його доставити, а також вартість їх послуг.' />
			<Paragraph
				text={
					<>
						<span>Увага!</span> Надання послуги доставки починається з моменту
						відправки товару. Якщо ви скасували замовлення після відправки
						товару, не прийшли за ним, відмовились або повернули отриманий товар
						продавцю, плата за доставку не повертається.
					</>
				}
			/>
			<Paragraph text='Вартість доставки товарів становить:' />
			<List
				list={
					<>
						<li>Кур’єром до ваших дверей - 100 грн;</li>
						<li>Укрпошта - 49 грн;</li>
						<li>
							Нова Пошта - 69 грн. На замовлення на суму від 1000 грн - вартість
							доставки - 1 грн.
						</li>
					</>
				}
			/>
			<Paragraph
				text={
					<>
						<span>Зверніть увагу!</span> Якщо доставка товару з оплатою після
						отримання, ви також сплачуєте комісію за переказ коштів згідно
						тарифів, що діють у відповідній службі доставки для замовлень Lama
						store:
					</>
				}
			/>
			<List
				list={
					<>
						<li>УкрПошта - 10 грн + 2% від суми переказу;</li>
						<li>Відділення Нова Пошта - 20 грн. + 2% від суми переказу.</li>
					</>
				}
			/>
			<Paragraph text='Комісію за переказ коштів утримує фінансова компанія, що забезпечує грошові перекази у відповідній службі доставки. Lama store не отримує і не повертає комісію за переказ коштів.' />
			<Paragraph text='Термін зберігання посилки у відділеннях - 5 робочих днів.' />
			<Paragraph text='За зберігання понад встановлений строк служби доставки можуть встановлювати плату за зберігання, про що повідомляють покупця самостійно.' />
			<Subtitle title='Оплата онлайн' />
			<Paragraph text='До сплати приймаються картки Visa і Mastercard або електронними гаманцями GooglePay або ApplePay. Будь ласка, переконайтеся, що ваша карта має активний дозвіл на оплату в інтернеті.' />
			<Paragraph text='Отримання, зберігання і обробку даних банківської карти, отриманих таким способом, здійснює виключно Фінансова компанія «Pcisecuritystandards», яка має Ліцензію на переказ коштів у національній валюті без відкриття рахунків, видану НБУ 05.12.2016 р. за № 51, та пройшла аудит міжнародного рівня PCI DSS, отримала відповідний сертифікат і гарантує захищеність даних.' />
			<Paragraph text='Ні адміністратору маркетплейса, ні іншим покупцям не доступні дані банківських карт, введені через сайт Lama store.' />
			<Paragraph text='З більш детальними умовами здійснення грошових переказів можна ознайомитися на офіційному веб-сайті фінансового партнера:' />
			<List
				list={
					<>
						<li>
							Фінансова компанія <Link href='#'>«Pcisecuritystandards».</Link>
						</li>
					</>
				}
			/>
			<Paragraph
				text={
					<>
						<span>Бонуси та промокод</span> Якщо у вашому Профілі є бонуси,
						доступні до використання, або ви отримали промокод, ви можете
						застосувати його для отримання знижки при оплаті замовлених товарів
						на сайті.
					</>
				}
			/>
			<Subtitle title='Оплата при отриманні' />
			<Paragraph
				text={
					<>
						<span>Готівка</span>
					</>
				}
			/>
			<Paragraph text='Такий спосіб оплати доступний:' />
			<List
				list={
					<>
						<li>при отриманні товару у відділеннях служб доставки;</li>
						<li>при кур’єрській доставці.</li>
					</>
				}
			/>
			<Paragraph
				text={
					<>
						<span>Зверніть увагу!</span> Якщо доставка товару з оплатою після
						отримання, ви також сплачуєте комісію за переказ коштів згідно
						тарифів, що діють у відповідній службі доставки для замовлень Lama
						store:
					</>
				}
			/>
			<List
				list={
					<>
						<li>Укрпошта - 10 грн + 2% від суми переказу;</li>
						<li>Нова Пошта - 20 грн. + 2% від суми переказу.</li>
					</>
				}
			/>
			<Paragraph text='Комісію за переказ коштів утримує фінансова компанія, що забезпечує грошові перекази у відповідній службі доставки. Lama store не отримує і не повертає комісію за переказ коштів.' />
			<Subtitle title='Банківська карта при отриманні' />
			<Paragraph text='Оплата банківською карткою можлива у відділеннях всіх служб доставки.' />
			<Paragraph
				text={
					<>
						<span>Зверніть увагу!</span> Якщо доставка товару з оплатою після
						отримання, ви також сплачуєте комісію за переказ коштів згідно
						тарифів, що діють у відповідній службі доставки (поточні тарифи
						дивіться вище в розділі «Готівка»).
					</>
				}
			/>
		</>
	)
}

export default DeliveryPage
